Collecting seaborn
  Downloading seaborn-0.13.2-py3-none-any.whl (294 kB)
     ------------------------------------ 294.9/294.9 kB 912.4 kB/s eta 0:00:00
Collecting pandas
  Downloading pandas-2.3.3-cp310-cp310-win_amd64.whl (11.3 MB)
     ---------------------------------------- 11.3/11.3 MB 9.4 MB/s eta 0:00:00
Collecting matplotlib!=3.6.1,>=3.4
  Downloading matplotlib-3.10.7-cp310-cp310-win_amd64.whl (8.1 MB)
     ---------------------------------------- 8.1/8.1 MB 9.8 MB/s eta 0:00:00
Collecting numpy!=1.24.0,>=1.20
  Downloading numpy-2.2.6-cp310-cp310-win_amd64.whl (12.9 MB)
     ---------------------------------------- 12.9/12.9 MB 7.4 MB/s eta 0:00:00
Collecting pytz>=2020.1
  Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
     ------------------------------------- 509.2/509.2 kB 10.6 MB/s eta 0:00:00
Collecting python-dateutil>=2.8.2
  Downloading python_dateutil-2.9.0.post0-py2.py3-none-any.whl (229 kB)
     -------------------------------------- 229.9/229.9 kB 7.1 MB/s eta 0:00:00
Collecting tzdata>=2022.7
  Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
     -------------------------------------- 347.8/347.8 kB 7.3 MB/s eta 0:00:00
Collecting kiwisolver>=1.3.1
  Downloading kiwisolver-1.4.9-cp310-cp310-win_amd64.whl (73 kB)
     ---------------------------------------- 73.7/73.7 kB 4.2 MB/s eta 0:00:00
Collecting pyparsing>=3
  Downloading pyparsing-3.2.5-py3-none-any.whl (113 kB)
     -------------------------------------- 113.9/113.9 kB 2.3 MB/s eta 0:00:00
Collecting cycler>=0.10
  Downloading cycler-0.12.1-py3-none-any.whl (8.3 kB)
Collecting contourpy>=1.0.1
  Downloading contourpy-1.3.2-cp310-cp310-win_amd64.whl (221 kB)
     ------------------------------------- 221.2/221.2 kB 13.2 MB/s eta 0:00:00
Collecting packaging>=20.0
  Downloading packaging-25.0-py3-none-any.whl (66 kB)
     ---------------------------------------- 66.5/66.5 kB 3.7 MB/s eta 0:00:00
Collecting pillow>=8
  Downloading pillow-12.0.0-cp310-cp310-win_amd64.whl (7.0 MB)
     ---------------------------------------- 7.0/7.0 MB 8.0 MB/s eta 0:00:00
Collecting fonttools>=4.22.0
  Downloading fonttools-4.61.0-cp310-cp310-win_amd64.whl (1.5 MB)
     ---------------------------------------- 1.5/1.5 MB 4.5 MB/s eta 0:00:00
Collecting six>=1.5
  Downloading six-1.17.0-py2.py3-none-any.whl (11 kB)
Installing collected packages: pytz, tzdata, six, pyparsing, pillow, packaging, numpy, kiwisolver, fonttools, cycler, python-dateutil, contourpy, pandas, matplotlib, seaborn
Successfully installed contourpy-1.3.2 cycler-0.12.1 fonttools-4.61.0 kiwisolver-1.4.9 matplotlib-3.10.7 numpy-2.2.6 packaging-25.0 pandas-2.3.3 pillow-12.0.0 pyparsing-3.2.5 python-dateutil-2.9.0.post0 pytz-2025.2 seaborn-0.13.2 six-1.17.0 tzdata-2025.2

[notice] A new release of pip available: 22.3.1 -> 25.3
[notice] To update, run: C:\Python310\python.exe -m pip install --upgrade pip

In [ ]:
# import necessary libraries
import seaborn as sns
import pandas as pd

In [2]:
df = pd.read_csv("titanic.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.shape

(891, 12)

In [6]:
print("Missing values per column:")
print(df.isna().sum())

Missing values per column:
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [7]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [8]:
target = 'survived' if 'survived' in df.columns else 'Survived'
print("\nTarget counts:")
print(df[target].value_counts(dropna=False))

Target counts:
Survived
0    549
1    342
Name: count, dtype: int64

In [11]:
features = ['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked']

In [12]:
df_small = df[features + [target]].copy()

In [17]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [13]:
df_small.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked  Survived
0       3    male  22.0      1      0   7.2500        S         0
1       1  female  38.0      1      0  71.2833        C         1
2       3  female  26.0      0      0   7.9250        S         1
3       1  female  35.0      1      0  53.1000        S         1
4       3    male  35.0      0      0   8.0500        S         0

In [15]:
df_small.shape

(891, 8)

In [20]:
from sklearn.impute import SimpleImputer
import numpy as np

X = df_small.drop(columns=[target]).copy()
y = df_small[target].astype(int).copy()

numeric_cols = ['Age', 'SibSp', 'Parch', 'Fare']
cat_cols = ['Sex', 'Pclass', 'Embarked']

# Show missing before
print("Missing before:")
print(X[numeric_cols + cat_cols].isna().sum())

# Numeric imputer
num_imputer = SimpleImputer(strategy='median')
X[numeric_cols] = num_imputer.fit_transform(X[numeric_cols])

# Categorical imputer
cat_imputer = SimpleImputer(strategy='most_frequent')
X[cat_cols] = cat_imputer.fit_transform(X[cat_cols])

print("\nMissing after:")
print(X[numeric_cols + cat_cols].isna().sum())

Missing before:
Age         177
SibSp         0
Parch         0
Fare          0
Sex           0
Pclass        0
Embarked      2
dtype: int64

Missing after:
Age         0
SibSp       0
Parch       0
Fare        0
Sex         0
Pclass      0
Embarked    0
dtype: int64

In [21]:
X_encoded = pd.get_dummies(X, columns=cat_cols, drop_first=True)
print("Shape after encoding:", X_encoded.shape)
display(X_encoded.head())

Shape after encoding: (891, 9)

,Age,SibSp,Parch,Fare,Sex_male,Pclass_2,Pclass_3,Embarked_Q,Embarked_S
0,22.0,1.0,0.0,7.2500,True,False,True,False,True
1,38.0,1.0,0.0,71.2833,False,False,False,False,False
2,26.0,0.0,0.0,7.9250,False,False,True,False,True
3,35.0,1.0,0.0,53.1000,False,False,False,False,True
4,35.0,0.0,0.0,8.0500,True,False,True,False,True

In [23]:
X_encoded.shape

(891, 9)

In [24]:
X_encoded.head()

,Age,SibSp,Parch,Fare,Sex_male,Pclass_2,Pclass_3,Embarked_Q,Embarked_S
0,22.0,1.0,0.0,7.2500,True,False,True,False,True
1,38.0,1.0,0.0,71.2833,False,False,False,False,False
2,26.0,0.0,0.0,7.9250,False,False,True,False,True
3,35.0,1.0,0.0,53.1000,False,False,False,False,True
4,35.0,0.0,0.0,8.0500,True,False,True,False,True

In [25]:
X.head()

  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0      3    male  22.0    1.0    0.0   7.2500        S
1      1  female  38.0    1.0    0.0  71.2833        C
2      3  female  26.0    0.0    0.0   7.9250        S
3      1  female  35.0    1.0    0.0  53.1000        S
4      3    male  35.0    0.0    0.0   8.0500        S

In [26]:
X.shape

(891, 7)

In [27]:
y

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [28]:
# STEP 7: Train-test split
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(
    X_encoded, y, test_size=0.25, random_state=42, stratify=y
)

print("Train shape:", X_train.shape)
print("Test shape:", X_test.shape)

Train shape: (668, 9)
Test shape: (223, 9)

In [30]:
# STEP 8: Scaling numeric features
from sklearn.preprocessing import StandardScaler

numeric_cols = ['Age', 'SibSp', 'Parch', 'Fare']  # same names as before
scaler = StandardScaler()

# Fit on train numeric columns, transform both
X_train[numeric_cols] = scaler.fit_transform(X_train[numeric_cols])
X_test[numeric_cols] = scaler.transform(X_test[numeric_cols])

# Show mean/std (approx 0 and 1 on train)
print("Train numeric mean (approx):", X_train[numeric_cols].mean().round(3).tolist())
print("Train numeric std (approx):", X_train[numeric_cols].std().round(3).tolist())

Train numeric mean (approx): [0.0, 0.0, -0.0, 0.0]
Train numeric std (approx): [1.001, 1.001, 1.001, 1.001]

In [47]:
# STEP 9: Train logistic regression
from sklearn.linear_model import LogisticRegression,

model = LogisticRegression()
model.fit(X_train, y_train)

print("Model trained. Coefficients shape:", model.coef_.shape)

SyntaxError: trailing comma not allowed without surrounding parentheses (3413061001.py, line 2)

In [48]:
from sklearn.metrics import accuracy_score, precision_score, recall_score, f1_score, roc_auc_score, confusion_matrix, classification_report
import numpy as np

y_pred = model.predict(X_test)
y_proba = model.predict_proba(X_test)[:,1]

acc = accuracy_score(y_test, y_pred)
prec = precision_score(y_test, y_pred)
rec = recall_score(y_test, y_pred)
f1 = f1_score(y_test, y_pred)
roc = roc_auc_score(y_test, y_proba)
cm = confusion_matrix(y_test, y_pred)

print(f"Accuracy: {acc:.4f}")
print(f"Precision: {prec:.4f}")
print(f"Recall: {rec:.4f}")
print(f"F1-score: {f1:.4f}")
print(f"ROC AUC: {roc:.4f}")
print("\nConfusion Matrix:\n", cm)
print("\nClassification Report:\n", classification_report(y_test, y_pred))

Accuracy: 0.7803
Precision: 0.7342
Recall: 0.6744
F1-score: 0.7030
ROC AUC: 0.8403

Confusion Matrix:
 [[116  21]
 [ 28  58]]

Classification Report:
               precision    recall  f1-score   support

           0       0.81      0.85      0.83       137
           1       0.73      0.67      0.70        86

    accuracy                           0.78       223
   macro avg       0.77      0.76      0.76       223
weighted avg       0.78      0.78      0.78       223